swak4Foam/Examples/BugCases/storedVariableParallelSegFaultCavity/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        // type            fixedValue;
        type groovyBC;
        value           uniform (1 0 0);
        valueExpression "vector(1,0,0)";
        variables (
            "steps=steps+1;"
            "step2=step2+1;"
        );
        storedVariables (
            {
                name steps;
                initialValue "0";
            }
            {
                name step2;
                initialValue "pos().x";
            }
        );
    }

    fixedWalls
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
